Coding/Cpp/auto_ptr.html
<?xml version="1.0" encoding="gb18030"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>auto_ptr</title>
<meta http-equiv="Content-Type" content="text/html;charset=gb18030"/>
<meta name="title" content="auto_ptr"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-10-19 22:32:03 CST"/>
<meta name="author" content="visaya fan"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<div id="org-div-comments"><a href="../../index.html#cpp">Ö÷Ò³</a><br/><a href="#disqus_thread">ÆÀÂÛ</a></div>


</head>
<body>


<div id="content">
<h1 class="title">auto_ptr</h1>


<script type="text/javascript" src="https://ajax.googleapis.com/ajax/libs/jquery/1.7.1/jquery.min.js"> </script>
<link rel="stylesheet" type="text/css" href="../../Layout/CSS/vf.css" />
<script src="../../Layout/JS/bootstrap_old.js"></script>


<pre class="src src-c++"><span style="color: #b22222;">/*</span>
<span style="color: #b22222;">  auto_ptr&#26159;&#26234;&#33021;&#25351;&#24341;&#65292;&#21487;&#20197;&#33258;&#25105;&#38144;&#27585;&#32780;&#19981;&#20687;new&#20986;&#26469;&#30340;&#23545;&#35937;&#19968;&#26679;&#38656;&#35201;&#35843;&#29992;delete&#38144;&#27585;&#12290;</span>
<span style="color: #b22222;">  auto_ptr&#36171;&#20540;&#29992;&#24341;&#36215;&#25152;&#26377;&#26435;&#30340;&#20132;&#25509;&#65292;&#20316;&#20026;&#20989;&#25968;&#21442;&#25968;&#25110;&#36820;&#22238;&#20540;&#37117;&#20250;&#24341;&#36215;&#25152;&#26377;&#26435;&#30340;&#20132;&#25509;&#12290;</span>
<span style="color: #b22222;">  auto_ptr&#24517;&#39035;&#26174;&#31034;&#21021;&#22987;&#21270;</span>
<span style="color: #b22222;">  auto_ptr&lt;int&gt; p(new int(43)) //ok</span>
<span style="color: #b22222;">  auto_ptr&lt;int&gt; p = new int(43) //error</span>
<span style="color: #b22222;">  auto_ptr&lt;int&gt; p;</span>
<span style="color: #b22222;">  p = new int(43);      //error</span>
<span style="color: #b22222;">  p = auto_ptr&lt;int&gt;(43) //ok</span>

<span style="color: #b22222;">  auto_ptr&#30340;&#20989;&#25968;&#65306;</span>
<span style="color: #b22222;">  Type* release() throw();      //&#23558;&#35813;auto_ptr&#35774;&#20026;null&#65292;&#24182;&#19988;&#36820;&#22238;&#35813;&#23545;&#35937;&#30340;&#22320;&#22336;</span>
<span style="color: #b22222;">  void reset(TYPE *_ptr = 0);   //&#29992;&#26469;&#25509;&#25910;&#25152;&#26377;&#26435;&#65292;&#22914;&#26524;&#25509;&#25910;&#25152;&#26377;&#26435;&#32773;&#24050;&#32463;&#25317;&#26377;&#20102;&#23545;&#35937;&#65292;&#21017;&#24517;&#39035;&#20808;&#37322;&#25918;&#35813;&#23545;&#35937;&#12290;&#20854;&#20013;_ptr&#26159;TYPE&#31867;&#22411;&#30340;&#25351;&#38024;&#65292;&#23427;&#23558;&#20250;&#26367;&#25442;&#21407;&#26469;auto_ptr&#25152;&#25317;&#26377;&#30340;&#25351;&#38024;&#12290;</span>
<span style="color: #b22222;">  TYPE* get() const throw;      //&#36820;&#22238;&#35813;&#31867;&#23384;&#20648;&#30340;&#25351;&#38024;&#12290;</span>
<span style="color: #b22222;"> */</span>

<span style="color: #7a378b;">#include</span> <span style="color: #8b2252;">&lt;memory&gt;</span>
<span style="color: #7a378b;">#include</span> <span style="color: #8b2252;">&lt;iostream&gt;</span>
<span style="color: #a020f0;">using</span> <span style="color: #a020f0;">namespace</span> <span style="color: #008b8b;">std</span>;
<span style="color: #a020f0;">class</span> <span style="color: #228b22;">Int</span> 
{
<span style="color: #a020f0;">public</span>:
    <span style="color: #0000ff;">Int</span>( <span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span> ) {
        x = i;
        cout &lt;&lt; <span style="color: #8b2252;">"Constructing "</span> &lt;&lt; ( <span style="color: #228b22;">void</span>* )<span style="color: #a020f0;">this</span> &lt;&lt; <span style="color: #8b2252;">" Value: "</span> &lt;&lt; x &lt;&lt; endl; 
    };
    ~<span style="color: #0000ff;">Int</span>( ) {
        cout &lt;&lt; <span style="color: #8b2252;">"Destructing "</span> &lt;&lt; ( <span style="color: #228b22;">void</span>* )<span style="color: #a020f0;">this</span> &lt;&lt; <span style="color: #8b2252;">" Value: "</span> &lt;&lt; x &lt;&lt; endl; 
    };
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">x</span>;
};
<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>( ) 
{
    <span style="color: #228b22;">auto_ptr</span>&lt;<span style="color: #228b22;">Int</span>&gt; <span style="color: #a0522d;">pi</span> ( <span style="color: #a020f0;">new</span> <span style="color: #228b22;">Int</span>( 5 ) );
    pi.reset( <span style="color: #a020f0;">new</span> <span style="color: #228b22;">Int</span>( 6 ) );
    <span style="color: #228b22;">Int</span>* <span style="color: #a0522d;">pi2</span> = pi.get ( );
    <span style="color: #228b22;">Int</span>* <span style="color: #a0522d;">pi3</span> = pi.release ( );
    cout&lt;&lt;pi.get()&lt;&lt;endl;
    <span style="color: #a020f0;">if</span> ( pi2 == pi3 )
        cout &lt;&lt; <span style="color: #8b2252;">"pi2 == pi3"</span> &lt;&lt; endl;
    <span style="color: #a020f0;">delete</span> pi3;
}
<span style="color: #b22222;">/*</span>
<span style="color: #b22222;">Constructing 0x3e2be8 Value: 5</span>
<span style="color: #b22222;">Constructing 0x3e4af8 Value: 6</span>
<span style="color: #b22222;">Destructing 0x3e2be8 Value: 5   //&#19968;&#20010;auto_ptr&#21482;&#33021;&#25351;&#21521;&#19968;&#20010;&#23545;&#35937;&#65292;&#25152;&#20197;&#22312;&#36171;&#26032;&#20540;&#21069;&#20808;&#35201;&#38144;&#27585;&#26087;&#30340;&#12290;</span>
<span style="color: #b22222;">0                               //&#35843;&#29992;release()&#21518;auto_ptr&#36820;&#22238;&#20854;&#23384;&#20648;&#20540;&#65292;&#24182;&#36171;&#31354;&#65292;</span>
<span style="color: #b22222;">pi2 == pi3                      //pi2&#19982;pi3&#37117;&#26159;&#21407;&#26469;pi&#23384;&#20648;&#31867;&#30340;&#25351;&#38024;&#12290;</span>
<span style="color: #b22222;">Destructing 0x3e4af8 Value: 6</span>
<span style="color: #b22222;"> */</span>
</pre>

<script src="../../Layout/JS/disqus-comment.js"></script>
<div id="disqus_thread">
</div>
</div>

</body>
</html>
